# ####################################################################

#  Created by Genus(TM) Synthesis Solution 22.10-p001_1 on Thu Apr 17 15:22:29 +07 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design ATmega328pb

create_clock -name "CLK" -period 50.0 -waveform {0.0 25.0} [get_ports clk]
create_clock -name "scl_i" -period 10000.0 -waveform {0.0 5000.0} 
set_clock_transition -min 0.3 [get_clocks CLK]
set_clock_transition -max 0.5 [get_clocks CLK]
set_clock_transition -min 0.3 [get_clocks scl_i]
set_clock_transition -max 0.5 [get_clocks scl_i]
set_load -pin_load 0.0022 [get_ports {pc[13]}]
set_load -pin_load 0.0022 [get_ports {pc[12]}]
set_load -pin_load 0.0022 [get_ports {pc[11]}]
set_load -pin_load 0.0022 [get_ports {pc[10]}]
set_load -pin_load 0.0022 [get_ports {pc[9]}]
set_load -pin_load 0.0022 [get_ports {pc[8]}]
set_load -pin_load 0.0022 [get_ports {pc[7]}]
set_load -pin_load 0.0022 [get_ports {pc[6]}]
set_load -pin_load 0.0022 [get_ports {pc[5]}]
set_load -pin_load 0.0022 [get_ports {pc[4]}]
set_load -pin_load 0.0022 [get_ports {pc[3]}]
set_load -pin_load 0.0022 [get_ports {pc[2]}]
set_load -pin_load 0.0022 [get_ports {pc[1]}]
set_load -pin_load 0.0022 [get_ports {pc[0]}]
set_load -pin_load 0.0022 [get_ports sram_we]
set_load -pin_load 0.0022 [get_ports sram_re]
set_load -pin_load 0.0022 [get_ports {sramadr[11]}]
set_load -pin_load 0.0022 [get_ports {sramadr[10]}]
set_load -pin_load 0.0022 [get_ports {sramadr[9]}]
set_load -pin_load 0.0022 [get_ports {sramadr[8]}]
set_load -pin_load 0.0022 [get_ports {sramadr[7]}]
set_load -pin_load 0.0022 [get_ports {sramadr[6]}]
set_load -pin_load 0.0022 [get_ports {sramadr[5]}]
set_load -pin_load 0.0022 [get_ports {sramadr[4]}]
set_load -pin_load 0.0022 [get_ports {sramadr[3]}]
set_load -pin_load 0.0022 [get_ports {sramadr[2]}]
set_load -pin_load 0.0022 [get_ports {sramadr[1]}]
set_load -pin_load 0.0022 [get_ports {sramadr[0]}]
set_load -pin_load 0.0022 [get_ports {sram_din[7]}]
set_load -pin_load 0.0022 [get_ports {sram_din[6]}]
set_load -pin_load 0.0022 [get_ports {sram_din[5]}]
set_load -pin_load 0.0022 [get_ports {sram_din[4]}]
set_load -pin_load 0.0022 [get_ports {sram_din[3]}]
set_load -pin_load 0.0022 [get_ports {sram_din[2]}]
set_load -pin_load 0.0022 [get_ports {sram_din[1]}]
set_load -pin_load 0.0022 [get_ports {sram_din[0]}]
set_load -pin_load 0.0022 [get_ports spm_out]
set_load -pin_load 0.0022 [get_ports {pu_B[7]}]
set_load -pin_load 0.0022 [get_ports {pu_B[6]}]
set_load -pin_load 0.0022 [get_ports {pu_B[5]}]
set_load -pin_load 0.0022 [get_ports {pu_B[4]}]
set_load -pin_load 0.0022 [get_ports {pu_B[3]}]
set_load -pin_load 0.0022 [get_ports {pu_B[2]}]
set_load -pin_load 0.0022 [get_ports {pu_B[1]}]
set_load -pin_load 0.0022 [get_ports {pu_B[0]}]
set_load -pin_load 0.0022 [get_ports {dd_B[7]}]
set_load -pin_load 0.0022 [get_ports {dd_B[6]}]
set_load -pin_load 0.0022 [get_ports {dd_B[5]}]
set_load -pin_load 0.0022 [get_ports {dd_B[4]}]
set_load -pin_load 0.0022 [get_ports {dd_B[3]}]
set_load -pin_load 0.0022 [get_ports {dd_B[2]}]
set_load -pin_load 0.0022 [get_ports {dd_B[1]}]
set_load -pin_load 0.0022 [get_ports {dd_B[0]}]
set_load -pin_load 0.0022 [get_ports {pv_B[7]}]
set_load -pin_load 0.0022 [get_ports {pv_B[6]}]
set_load -pin_load 0.0022 [get_ports {pv_B[5]}]
set_load -pin_load 0.0022 [get_ports {pv_B[4]}]
set_load -pin_load 0.0022 [get_ports {pv_B[3]}]
set_load -pin_load 0.0022 [get_ports {pv_B[2]}]
set_load -pin_load 0.0022 [get_ports {pv_B[1]}]
set_load -pin_load 0.0022 [get_ports {pv_B[0]}]
set_load -pin_load 0.0022 [get_ports {die_B[7]}]
set_load -pin_load 0.0022 [get_ports {die_B[6]}]
set_load -pin_load 0.0022 [get_ports {die_B[5]}]
set_load -pin_load 0.0022 [get_ports {die_B[4]}]
set_load -pin_load 0.0022 [get_ports {die_B[3]}]
set_load -pin_load 0.0022 [get_ports {die_B[2]}]
set_load -pin_load 0.0022 [get_ports {die_B[1]}]
set_load -pin_load 0.0022 [get_ports {die_B[0]}]
set_load -pin_load 0.0022 [get_ports {pu_C[6]}]
set_load -pin_load 0.0022 [get_ports {pu_C[5]}]
set_load -pin_load 0.0022 [get_ports {pu_C[4]}]
set_load -pin_load 0.0022 [get_ports {pu_C[3]}]
set_load -pin_load 0.0022 [get_ports {pu_C[2]}]
set_load -pin_load 0.0022 [get_ports {pu_C[1]}]
set_load -pin_load 0.0022 [get_ports {pu_C[0]}]
set_load -pin_load 0.0022 [get_ports {dd_C[6]}]
set_load -pin_load 0.0022 [get_ports {dd_C[5]}]
set_load -pin_load 0.0022 [get_ports {dd_C[4]}]
set_load -pin_load 0.0022 [get_ports {dd_C[3]}]
set_load -pin_load 0.0022 [get_ports {dd_C[2]}]
set_load -pin_load 0.0022 [get_ports {dd_C[1]}]
set_load -pin_load 0.0022 [get_ports {dd_C[0]}]
set_load -pin_load 0.0022 [get_ports {pv_C[6]}]
set_load -pin_load 0.0022 [get_ports {pv_C[5]}]
set_load -pin_load 0.0022 [get_ports {pv_C[4]}]
set_load -pin_load 0.0022 [get_ports {pv_C[3]}]
set_load -pin_load 0.0022 [get_ports {pv_C[2]}]
set_load -pin_load 0.0022 [get_ports {pv_C[1]}]
set_load -pin_load 0.0022 [get_ports {pv_C[0]}]
set_load -pin_load 0.0022 [get_ports {die_C[6]}]
set_load -pin_load 0.0022 [get_ports {die_C[5]}]
set_load -pin_load 0.0022 [get_ports {die_C[4]}]
set_load -pin_load 0.0022 [get_ports {die_C[3]}]
set_load -pin_load 0.0022 [get_ports {die_C[2]}]
set_load -pin_load 0.0022 [get_ports {die_C[1]}]
set_load -pin_load 0.0022 [get_ports {die_C[0]}]
set_load -pin_load 0.0022 [get_ports {pu_D[7]}]
set_load -pin_load 0.0022 [get_ports {pu_D[6]}]
set_load -pin_load 0.0022 [get_ports {pu_D[5]}]
set_load -pin_load 0.0022 [get_ports {pu_D[4]}]
set_load -pin_load 0.0022 [get_ports {pu_D[3]}]
set_load -pin_load 0.0022 [get_ports {pu_D[2]}]
set_load -pin_load 0.0022 [get_ports {pu_D[1]}]
set_load -pin_load 0.0022 [get_ports {pu_D[0]}]
set_load -pin_load 0.0022 [get_ports {dd_D[7]}]
set_load -pin_load 0.0022 [get_ports {dd_D[6]}]
set_load -pin_load 0.0022 [get_ports {dd_D[5]}]
set_load -pin_load 0.0022 [get_ports {dd_D[4]}]
set_load -pin_load 0.0022 [get_ports {dd_D[3]}]
set_load -pin_load 0.0022 [get_ports {dd_D[2]}]
set_load -pin_load 0.0022 [get_ports {dd_D[1]}]
set_load -pin_load 0.0022 [get_ports {dd_D[0]}]
set_load -pin_load 0.0022 [get_ports {pv_D[7]}]
set_load -pin_load 0.0022 [get_ports {pv_D[6]}]
set_load -pin_load 0.0022 [get_ports {pv_D[5]}]
set_load -pin_load 0.0022 [get_ports {pv_D[4]}]
set_load -pin_load 0.0022 [get_ports {pv_D[3]}]
set_load -pin_load 0.0022 [get_ports {pv_D[2]}]
set_load -pin_load 0.0022 [get_ports {pv_D[1]}]
set_load -pin_load 0.0022 [get_ports {pv_D[0]}]
set_load -pin_load 0.0022 [get_ports {die_D[7]}]
set_load -pin_load 0.0022 [get_ports {die_D[6]}]
set_load -pin_load 0.0022 [get_ports {die_D[5]}]
set_load -pin_load 0.0022 [get_ports {die_D[4]}]
set_load -pin_load 0.0022 [get_ports {die_D[3]}]
set_load -pin_load 0.0022 [get_ports {die_D[2]}]
set_load -pin_load 0.0022 [get_ports {die_D[1]}]
set_load -pin_load 0.0022 [get_ports {die_D[0]}]
set_load -pin_load 0.0022 [get_ports {pu_E[3]}]
set_load -pin_load 0.0022 [get_ports {pu_E[2]}]
set_load -pin_load 0.0022 [get_ports {pu_E[1]}]
set_load -pin_load 0.0022 [get_ports {pu_E[0]}]
set_load -pin_load 0.0022 [get_ports {dd_E[3]}]
set_load -pin_load 0.0022 [get_ports {dd_E[2]}]
set_load -pin_load 0.0022 [get_ports {dd_E[1]}]
set_load -pin_load 0.0022 [get_ports {dd_E[0]}]
set_load -pin_load 0.0022 [get_ports {pv_E[3]}]
set_load -pin_load 0.0022 [get_ports {pv_E[2]}]
set_load -pin_load 0.0022 [get_ports {pv_E[1]}]
set_load -pin_load 0.0022 [get_ports {pv_E[0]}]
set_load -pin_load 0.0022 [get_ports {die_E[3]}]
set_load -pin_load 0.0022 [get_ports {die_E[2]}]
set_load -pin_load 0.0022 [get_ports {die_E[1]}]
set_load -pin_load 0.0022 [get_ports {die_E[0]}]
set_load -pin_load 0.0022 [get_ports tx]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports clk_en]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {Program_Mem_dout[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_dout[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINB_i[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINC_i[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINC_i[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINC_i[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINC_i[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINC_i[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINC_i[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINC_i[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PIND_i[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINE_i[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINE_i[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINE_i[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {PINE_i[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports rx]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pc[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports sram_we]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports sram_re]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sramadr[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {sram_din[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports spm_out]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_B[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_B[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_B[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_B[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_C[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_C[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_C[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_C[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_C[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_C[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_C[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_C[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_C[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_C[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_C[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_C[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_C[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_C[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_C[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_C[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_C[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_C[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_C[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_C[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_C[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_C[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_C[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_C[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_C[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_C[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_C[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_C[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_D[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_D[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_D[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_D[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_E[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_E[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_E[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pu_E[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_E[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_E[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_E[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {dd_E[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_E[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_E[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_E[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {pv_E[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_E[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_E[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_E[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports {die_E[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 2.0 [get_ports tx]
set_driving_cell -lib_cell CLKBUFHDV32 -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports clk]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports ireset]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports clk_en]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[15]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[14]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[13]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[12]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[11]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[10]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[9]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[8]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[7]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[6]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[5]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[4]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[3]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[2]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[1]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {Program_Mem_dout[0]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[7]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[6]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[5]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[4]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[3]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[2]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[1]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {sram_dout[0]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[7]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[6]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[5]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[4]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[3]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[2]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[1]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINB_i[0]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINC_i[6]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINC_i[5]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINC_i[4]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINC_i[3]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINC_i[2]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINC_i[1]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINC_i[0]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[7]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[6]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[5]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[4]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[3]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[2]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[1]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PIND_i[0]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINE_i[3]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINE_i[2]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINE_i[1]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports {PINE_i[0]}]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports rx]
set_ideal_network -no_propagate [get_nets clk]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 1.0 [get_clocks CLK]
set_clock_uncertainty -hold 0.25 [get_clocks CLK]
set_clock_uncertainty -setup 1.0 [get_clocks scl_i]
set_clock_uncertainty -hold 0.25 [get_clocks scl_i]
